
-- Данные для  задания 1, 2, 3, 4

INSERT INTO users (name)
VALUES
	('ООО Рога и копыта'),
	('ЗАО Ромашка'),
	('ЗАО Василек');

INSERT INTO contracts (client_id, d_number)
VALUES
	(1, '216/789'),
	(1, '2016/987'),
	(1, '2016/1234'),
	(2, '2005/11'),
	(2, '2005/555'),
	(2, '2006/333'),
	(3, '555/666'),
	(3, '666/111'),
	(3, '33/8889');
	
INSERT INTO operations (d_id, dt, summa)
VALUES
	(1, '2016-08-31', 800),
	(1, '2016-08-21', 50),
	(2, '2016-05-23', 100),
	(3, '2016-08-21', 200),
	(6, '2016-06-12', 300),
	(7, '2016-07-02', 400),
	(7, '2016-06-02', 500),
	(9, '2016-05-23', 600);



-- Данные для задания 4Б

INSERT INTO table_crosstab (nm, q1, q2, q3, q4)
VALUES
	('org1', 100, 200, 300, 400),
	('org2', 300, 400, 500, 600);



-- Данные для задания 5 - рекурсия

INSERT INTO podr (title)
VALUES 
	('ТБ1'),
	('ТБ2');

INSERT INTO podr (pid, title)
VALUES
	(1, 'ГОСБ1'),
	(1, 'ГОСБ2'),
	(1, 'ГОСБ3'),
	(2, 'ГОСБ21'),
	(2, 'ГОСБ22'),
	(3, 'ВСП6'),
	(3, 'ВСП1'),
	(6, 'ВСП2'),
	(3, 'ВСП3'),
	(4, 'ВСП4'),
	(5, 'ВСП5');



-- Данные для задания 4Б

INSERT INTO table1 (column1, column2)
VALUES 
	(13, 14),
	(13, 15);
	
INSERT INTO table2 (column1, column2)
VALUES 
	(13, 16),
	(13, 14);



-- Данные для задания 5

INSERT INTO student (name)
VALUES
	('Миша'),
	('Саша'),
	('Паша'),
	('Вова'),
	('Никита'),
	('Даша');
	
INSERT INTO lesson (title)
VALUES
	('Математика'),
	('Физика'),
	('История'),
	('Литература'),
	('Химия'),
	('Биология'),
	('География'),
	('Иностранный язык'),
	('Информатика'),
	('Искусство');

INSERT INTO student_lesson (student_id, lesson_id)
VALUES
	(1, 1),
	(2, 1),
	(3, 1),
	(4, 1),
	(5, 1),
	(6, 1),
	(2, 2),
	(2, 3),
	(3, 6),
	(3, 5),
	(1, 10),
	(2, 10),
	(3, 10),
	(4, 10),
	(5, 10),
	(6, 10),
	(1, 9),
	(1, 8);
	


-- Данные для задания 6

INSERT INTO table3 (value_date, value)
VALUES
	('2013-03-01', 1000000),
	('2013-04-01', 1500000),
	('2013-05-01', 2000000);

